# Задание 1

"Приведите к целому типу число 2.99"

x = 2.99
x = int(x)
print("x = ", x, "type: ", type(x))
